<a href="https://colab.research.google.com/github/pipeton8/6.439-stats-comp-applications/blob/main/Assignments/4%20-%20Networks/6.439%20-%20Problem%20Set%204.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Problem Set 4 - Statistics, Computation and Applications

(c) Felipe del Canto, November 2021
***
***

_Note: The dataset for this assignment was provided for in class use only. For this reason, this notebook will not run. I will try to provide a toy dataset in the future._

# Part 0 (Execute first!)

In [1]:
# Import packages
import scipy
import numpy as np
import pandas as pd
pd.options.display.float_format = '{:.4f}'.format

import seaborn           as sns
import matplotlib.pyplot as plt

from tqdm.auto import tqdm, trange

# Problem 4.2: Co-offending Network

## Preamble

In [96]:
# Load data
co_off = pd.read_csv("Cooffending.csv")

# Set date
co_off['date'] = pd.to_datetime(co_off['date'])

# Set crime codes, counties and locations as categorical
categorical_vars = [f'crime{k}_code' for k in range(1,5)] + ['county', 'location']
co_off[categorical_vars] = co_off[categorical_vars].astype('category')

In [97]:
co_off.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1280459 entries, 0 to 1280458
Data columns (total 14 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1280459 non-null  int64
 1   dob          1280459 non-null  int64
 2   sex          1280459 non-null  int64
 3   event_id     1280459 non-null  int64
 4   date         1280459 non-null  datetime64[ns]
 5   year         1280459 non-null  int64
 6   location     1280459 non-null  category
 7   county       1280459 non-null  category
 8   crime1_code  1280459 non-null  category
 9   crime2_code  1280459 non-null  category
 10  crime3_code  1280459 non-null  category
 11  crime4_code  1280459 non-null  category
 12  youths       1280459 non-null  int64
 13  adults       1280459 non-null  int64
dtypes: category(6), datetime64[ns](1), int64(7)
memory usage: 90.5 MB

In [98]:
co_off.describe(include='all', datetime_is_numeric=True)

                 id          dob  ...       youths       adults
count  1280459.0000 1280459.0000  ... 1280459.0000 1280459.0000
unique          nan          nan  ...          nan          nan
top             nan          nan  ...          nan          nan
freq            nan          nan  ...          nan          nan
mean    373509.6867    1973.4897  ...       0.0197       1.3399
min          1.0000    1007.0000  ...       0.0000       0.0000
25%     227274.5000    1964.0000  ...       0.0000       1.0000
50%     385083.0000    1976.0000  ...       0.0000       1.0000
75%     532909.0000    1984.0000  ...       0.0000       1.0000
max     670536.0000    2005.0000  ...      92.0000     156.0000
std     181007.7520      13.7975  ...       0.2620       2.5800

[11 rows x 14 columns]

In [99]:
co_off.head(10)

    id   dob  sex  event_id  ... crime3_code  crime4_code youths adults
0    1  1007    0   1085034  ...                               0      1
1    2  1828    0   1431379  ...                               0      1
2    4  1889    1    167174  ...                               0      1
3    5  1892    1   1179096  ...                               0      1
4   17  1897    1   1270690  ...                               0      3
5   38  1900    1    356360  ...                               0      1
6   39  1900    1   1171604  ...                               0      1
7   40  1900    1    852956  ...                               0      1
8  149  1901    1    806220  ...                               0      1
9  231  1902    1    778217  ...                               0      1

[10 rows x 14 columns]

## (a)

## (b)

## (c)

## (d)

## (e)

## (f)

## (g)

## (h)

## (i)

## (j)

## (k)

## (l)

## (m)